# задача такая, написать код который будет проверять слова которые можно прочитать как слево так и справо, и будет означать одно и тоже, как шалаш
word2 = "довод"
word1 = "шалаш" # создаю переменную в которой лежит слово
# ВТОРОЕ слово которое лежит в переменной(понял что мне не обязателен вторая переменная, достаточно в одно переменной создать словарь из нескольких слов)
def test(word): # пишу функцию, в ней будет два цикла на проверку слова(понял что не обязательно использовать несколько переменных, напишу лишь один, словарь)
  gogo = word.lower() # подсказка gtmini нужно было без цикла, просто начать действовать, первое, взять начальное слово, и все буквы что в ней есть, превратить в маленькие
  hil = gogo[::-1] # дальше то слово которое с маленькими буквами я переворачиваю и кладу в другую переменную
  if gogo == hil: # сравниваю слово с маленькими буквами с тем что перевернуто
    return True #если все правильно, true
  else:
    return False # если нет false
print(test(word1))
print(test(word2))
            
 # я решил попробовать создать базу, цикл который будет проверить переменную на переменную, однако у меня не получается, в голове понятно как можно это сделать, словарь в котором находятся слова, написать команду чтобы он достовал 0 слово, и проверял его саму на себя, если верно, сам напишет true верно, если нет ну там понятно, но у меня не получается это написать ибо мне она не известна, так же попробовал перевернутое слово перетащить в другую переменную чтобы было проще, но тоже не получается, как это сделать