ages = [15, 21, 18, 12, 25, 17, 30] # задача написать код который покажет мне числа больше или равные 18, я создам функцию, цикл, и внутри нее, сделаю так чтобы он перебирал каждые числа, если правда, вывести, лож, пропустить
def fuck(ages):
    hil = [] # нужно создать переменную в которую я позже положу информацуию.
    for go in ages: # создаю цикл
        if go >= 18: # делаю так чтобы было сравнение числа с указанным мною параметром
            hil.append(go) # ЕСЛИ ВСЕ ПРАВИЛЬНО, КЛАДЕМ В ПЕРЕМЕННУЮ КОТОРУЮ Я СОЗДАЛ ЧТОБЫ В НЕЕ ПОЛОЖИТЬ ДАННЫЕ
    return hil
print(fuck(ages))